Example_1/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Casson;

CassonCoeffs
{
	m	m [0 2 -1 0 0 0 0] 2.83e-6;
	tau0	tau0 [0 2 -2 0 0 0 0] 3.77e-6;
	nuMin	nuMin [0 2 -1 0 0 0 0] 2.83e-6;
	nuMax	nuMax [0 2 -1 0 0 0 0] 6.604e-5;
}

	gammac0         5.983e-12;

// ************************************************************************* //
